---
kind: method
id: M:Autodesk.Revit.DB.Dimension.IsTextPositionAdjustable
zh: 尺寸标注、标注
source: html/e3d0717c-713d-64b0-64a9-336cbb95519a.htm
---
# Autodesk.Revit.DB.Dimension.IsTextPositionAdjustable Method

**中文**: 尺寸标注、标注

Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition.

## Syntax (C#)
```csharp
public bool IsTextPositionAdjustable()
```